package ajax;

/**
 * 【I18N】
 *  国际化（Internationalization）指的是同一个网站可以支持多种不同的语言，以方便不同国家，不同语种的用户访问。
 *  关于国际化我们想到的最简单的方案就是为不同的国家创建不同的网站，比如苹果公司，他的英文官网是：http://www.apple.com 而中国官网是 http://www.apple.com/cn
 *    但是苹果公司这种方案并不适合全部公司，而我们希望相同的一个网站，而不同人访问的时候可以根据用户所在的区域显示不同的语言文字，而网站的布局样式等不发生改变。
 *    于是就有了我们说的国际化，国际化总的来说就是同一个网站不同国家的人来访问可以显示出不同的语言。
 *    但实际上这种需求并不强烈，一般真的有国际化需求的公司，主流采用的依然是苹果公司的那种方案，为不同的国家创建不同的页面。
 *    ✔所以国际化的内容我们了解一下即可。
 *  国际化的英文 Internationalization，但是由于拼写过长，简写为I18N
 *
 * 【】由于国际化是只需要了解的内容，所以未来需要用到的时候我再研究把
 @author Alex
 @create 2023-02-18-21:17
 */
public class UA04 {
}
